src/Catalogs/ПосадочныеМеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ПосадочныеМеста</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>МестоРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаРеализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретНесколькихЗаказов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>для персональных мест</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скидка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Скидки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоммутироемоеУстройство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоммутируемыеУстройства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛимитнаяКарта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаЛимита</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаМинимальнойПредоплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапросСуммыПредоплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретДовнесенияПредоплаты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИнтернетБронь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Емкость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>99</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лево</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Верх</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗанятоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>АвтоТовары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоКоличествуПосетителей</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПосадочныеМеста/Ext/ObjectModule.bsl
Процедура УстановитьКодВнутриИБ() Экспорт
	
	Если НЕ ЭтоНовый() И ИнформационнаяБаза = Ссылка.ИнформационнаяБаза Тогда
		Код = Ссылка.Код;
		Возврат;
	КонецЕсли; 
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 
	                      | Код ИЗ Справочник.ПосадочныеМеста
	                      |ГДЕ
	                      |	ИнформационнаяБаза = &ИнформационнаяБаза И 
	                      |	Ссылка <> &Ссылка
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Код УБЫВ");
						  
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Код = Выборка.Код + 1;
	Иначе
		Код = 1;
	КонецЕсли; 
	
КонецПроцедуры

Функция ПроверкаУникальностиКода()
	
	Запрос = Новый Запрос("ВЫБРАТЬ 
	                      | Код ИЗ Справочник.ПосадочныеМеста
	                      |ГДЕ
	                      |	ИнформационнаяБаза = &ИнформационнаяБаза И 
	                      |	Код = &Код И Ссылка <> &Ссылка
	                      |");
						  
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Код", Код);
	
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Пустой();
КонецФункции

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Наименование) Тогда
		Сообщить("Не заполнено наименование!",СтатусСообщения.Важное);
		Отказ = Истина;
	ИначеЕсли НЕ ЭтоГруппа И Уровень()=0 И ЭтоНовый() Тогда
		Сообщить("Попытка создать элемент без группы!",СтатусСообщения.Важное);
		Отказ = Истина;
	ИначеЕсли НЕ ПроверкаУникальностиКода() Тогда
		Сообщить("Код не уникален!",СтатусСообщения.Важное);
		Отказ = Истина;
		Если Не ЗначениеЗаполнено(Номер) Тогда
			Попытка
			
				Номер = Наименование;
			
			Исключение
			
			КонецПопытки; 
					
		
		КонецЕсли;
	КонецЕсли;
	ИнформационнаяБаза = ПараметрыСеанса.ТекущаяИБ;
	Если НЕ ЭтоГруппа И НЕ МестоРеализации.Пустая() И Ложь Тогда
		УстановитьКодВнутриИБ();
	КонецЕсли;
	
	//Проверка на изменение в шаблоне наименования посадочного места
	Если ЭтоГруппа И НЕ ЗначениеЗаполнено(ШаблонНаименования) Тогда
		ШаблонНаименования = "Стол №[Место.Номер]";
	КонецЕсли;		
	
КонецПроцедуры

#Если Клиент Тогда
// Перезаполнение наименованиий посадочных мест по шаблону
Процедура ПерезаполнениеНаименованийМестПоШаблону() Экспорт 
	
	Если НЕ ЭтоГруппа Тогда
		Сообщить("Перезаполнение наименований возможно только из группы!",СтатусСообщения.Важное);
        Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ШаблонНаименования) Тогда 
		Сообщить("Для заполнения наименований отсутствует шаблон!",СтатусСообщения.Важное);
        Возврат;
	КонецЕсли;		
	
	Если Вопрос("Перезаполнить наименование посадочных мест по указанному шаблону?", РежимДиалогаВопрос.ОКОтмена) = КодВозвратаДиалога.Отмена Тогда
		 Возврат;		
	КонецЕсли;

	ТекШаблон = ШаблонНаименования;
	
	ВыборкаМест = Справочники.ПосадочныеМеста.ВыбратьИерархически(Ссылка);
	
	Кл = 0;
	
	НачатьТранзакцию();
	
	Пока ВыборкаМест.Следующий() Цикл
		
		Если ВыборкаМест.ЭтоГруппа ИЛИ ВыборкаМест.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли; 
		
		Место = ВыборкаМест.ПолучитьОбъект();
		Место.Наименование = Вычислить(Шаблон2Выражение(ТекШаблон));
		Место.Записать();
		
		Кл = Кл + 1;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Предупреждение("Перезаполнено наименование " + Кл + " посадочных мест.");
	
КонецПроцедуры	

#КонецЕсли
